struct CachedPageEntry
{
    s32 pageIndex    = -1;
    
    b32 acHasArmor = FALSE;
    
    utf32 origin;
    utf32 shortDesc;
    utf32 AC;
    utf32 HP; utf32 totHP;
    utf32 ST;
    utf32 RD;
    utf32 RI;
    utf32 defensiveCapacity;
    utf32 melee;
    utf32 ranged;
    utf32 specialAttacks;
    utf32 psych;
    utf32 magics;
    utf32 spells;
    utf32 tactics_before;
    utf32 tactics_during;
    utf32 tactics_stats;
    utf32 skills; //TODO Separate type from value
    utf32 racialMods;
    utf32 spec_qual;
    utf32 given_equip;
    utf32 properties;
    utf32 boons;
    utf32 specials;
    utf32 org;
    utf32 treasure;
    utf32 desc;
    utf32 source;
    
    utf32 name;
    utf32 gs;
    utf32 pe;
    utf32 alignment;
    utf32 type;
    utf32 subtype;
    utf32 archetype;
    utf32 size;
    utf32 initiative;
    utf32 senses;
    utf32 perception;
    utf32 aura;
    utf32 immunities;
    utf32 resistances;
    utf32 weaknesses;
    utf32 speed;
    utf32 space;
    utf32 reach;
    utf32 STR;
    utf32 DEX;
    utf32 CON;
    utf32 INT;
    utf32 WIS;
    utf32 CHA;
    utf32 BAB;
    utf32 BMC;
    utf32 DMC;
    utf32 talents;
    utf32 languages;
    utf32 environment;
};

struct NPCPageEntry
{
    u32 origin;
    u32 shortDesc;
    u32 AC;
    u32 HP;
    u32 ST;
    u32 RD;
    u32 RI;
    u32 defensiveCapacity;
    u32 melee;
    u32 ranged;
    u32 specialAttacks;
    u32 psych;
    u32 magics;
    u32 spells;
    u32 tactics[3];
    u32 skills[24]; //TODO Separate type from value
    u32 racialMods;
    u32 spec_qual;
    u32 given_equip;
    u32 properties;
    u32 boons;
    u32 specials[24];
    u32 desc;
    u32 source;
    
    u16 name;
    u16 gs;
    u16 pe;
    u16 alignment;
    u16 type;
    u16 subtype[8];
    u16 archetype[4];
    u16 size;
    u16 initiative;
    u16 senses[8];
    u16 perception;
    u16 aura;
    u16 immunities[16];
    u16 resistances[16];
    u16 weaknesses[16];
    u16 speed;
    u16 space;
    u16 reach;
    u16 STR;
    u16 DEX;
    u16 CON;
    u16 INT;
    u16 WIS;
    u16 CHA;
    u16 BAB;
    u16 BMC;
    u16 DMC;
    u16 talents[24];
    u16 languages[24];
};

struct PageEntry
{
    u32 origin;            //4
    u32 shortDesc;         //8
    u32 AC;                //12
    u32 HP;                //16
    u32 ST;                //20
    u32 RD;                //24
    u32 RI;                //28
    u32 defensiveCapacity; //32
    u32 melee;             //36
    u32 ranged;            //40
    u32 specialAttacks;    //44
    u32 psych;             //48
    u32 magics;            //52
    u32 spells;            //56
    u32 skills[24];        //152    //TODO Separate type from value
    u32 racialMods;        //156
    u32 spec_qual;         //160
    u32 specials[24];      //256
    u32 org;               //260
    u32 treasure;          //264
    u32 desc;              //268
    u32 source;            //272
    
    u16 name;              //274
    u16 gs;                //276
    u16 pe;                //278
    u16 alignment;         //280
    u16 type;              //282
    u16 subtype[8];        //298
    u16 archetype[4];      //306
    u16 size;              //308
    u16 initiative;        //310
    u16 senses[8];         //326
    u16 perception;        //328
    u16 aura;              //330
    u16 immunities[16];    //362
    u16 resistances[16];   //394
    u16 weaknesses[16];    //426
    u16 speed;             //428
    u16 space;             //430
    u16 reach;             //432
    u16 STR;               //434
    u16 DEX;               //436
    u16 CON;               //438
    u16 INT;               //440
    u16 WIS;               //442
    u16 CHA;               //444
    u16 BAB;               //446
    u16 BMC;               //448
    u16 DMC;               //450
    u16 talents[24];       //498
    u16 languages[24];     //546
    u16 environment;       //548
};

struct Codex
{
    buffer names;
    buffer gs;
    buffer types;
    buffer subtypes;
    
    buffer generalStrings;
    buffer numericValues;
    buffer pe;
    buffer alignment;
    buffer archetypes;
    buffer sizes;
    buffer senses;
    buffer auras;
    buffer immunities;
    buffer resistances;
    buffer weaknesses;
    buffer specialAttacks;
    buffer spells;
    buffer talents;
    buffer skills;
    buffer languages;
    buffer environment;
    buffer specials;
    
    //TODO: Change this to a FixedArray
    Array<PageEntry>    pages;
    Array<NPCPageEntry> npcPages;
};

const s32 NPC_PAGE_INDEX_OFFSET = 5000;

struct Compendium
{
    Codex codex;
    
    UITextBox  searchBarMobs;
    UITextBox  searchBarNPCs;
    
    b32        isViewingPage;
    s32        pageIndex = -1;
    Array<u16> viewIndices;
    
    //TODO: Hate this, make isViewing* more consistent!
    b32        isViewingNPCTable;
    Array<u16> npcViewIndices;
};

